[
  {
    "Id": "107986",
    "ThreadId": "32568",
    "Html": "Hi,<br>\r\n&nbsp; First of all...great project. :)<br>\r\n&nbsp; I would like to remove some icons form the toolbar but removing some of them from the toolbar by just commenting out code lines as for the emoticons icon doesn't work...that is after recompile which is successfull the RTE control will not render in the ACT tab control (dunno if it would render if it was placed outside of it). In particular I'd like to remove the list of fonts, the hyperlink, background and foreground color icons, beside the emoticon whose removal method as suggested here in one previous discussion (comment out&nbsp; line <em>toolbar.AddButton(AjaxControls.ToolBar.ToolbarItemType.ImageButton, ToolTips[&quot;Emoticons&quot;].ToString(), 17, &quot;OnEmoticon&quot;,null,&quot;RteEmoticon&quot;)</em>) does work for me.<br>\r\n&nbsp; &nbsp; TIA<br>\r\n",
    "PostedDate": "2008-07-30T08:42:04.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "108854",
    "ThreadId": "32568",
    "Html": "Bump... :)<br>\r\nReally? No one has any info on removing additional toolbar buttons beside the emoticon button? How about disabling the buttons at least (graying them out)? I see that once you switch from Text to Html View all the buttons on the toolbar get grayed out (which is as far as I can tell done in stratup.js), so how about a way to disable certain buttons both in starting Text and Html View too, please?<br>\r\nThanks in advance good ppl...<br>\r\n",
    "PostedDate": "2008-08-04T04:17:01.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110130",
    "ThreadId": "32568",
    "Html": "Maybe there is an easier way but I removed buttons by removing references to the buttons I didn't want from the i18N.xml file.&nbsp; I then had to remove references to the unwanted buttons from the RteStartup.js and rte.cs files. <br>\r\n",
    "PostedDate": "2008-08-09T10:02:31.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110426",
    "ThreadId": "32568",
    "Html": "DarenTx, that's pretty much the only way to remove buttons at the moment. I don't remember having to edit the i18N.xml file though.<br>\r\n<br>\r\nThis is on my list of features to add but it's a good amount of work to do it right. I'm thinking of creating a template system so that, in addition to removing buttons, you can also re-order them.<br>\r\n",
    "PostedDate": "2008-08-11T14:36:26.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]