[
  {
    "Id": "110466",
    "ThreadId": "33330",
    "Html": "I would like to make the suggestion of adding a validation property with a metadata attribute.&nbsp; If I understand this correctly, it will allow the RTE to be a target of validation controls.&nbsp; The obvious target would be the Text properity.<br>\r\n<br>\r\n<a href=\"http://msdn.microsoft.com/en-us/library/system.web.ui.validationpropertyattribute.aspx\">http://msdn.microsoft.com/en-us/library/system.web.ui.validationpropertyattribute.aspx</a><br>\r\n<br>\r\n",
    "PostedDate": "2008-08-11T18:26:39.067-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111136",
    "ThreadId": "33330",
    "Html": "Thanks for the heads up. There are additional challenges to overcome related to validation:<br>\r\n<ol>\r\n    <li>Text property is refreshed &quot;on demand&quot; via a Javascript function so client side validation will need to account for that.</li>\r\n    <li>Required validation, which is the validation most developers want with RTE, needs to take HTML markup into account. For instance should &quot;&lt;div&gt;&lt;/div&gt;&quot; pass required validation?</li>\r\n    <li>Others... ???</li>\r\n</ol>\r\n",
    "PostedDate": "2008-08-14T09:14:46.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113211",
    "ThreadId": "33330",
    "Html": "I do not have too much experience with web controls, most of what I have done is with user controls, so I may not be much of a help here...&nbsp; <br>\r\n<br>\r\nTo your first point, if I read correctly, you are planning having the Text property update automatically.&nbsp; As to the second, you could possibly have a second text value with all of the html stripped out and updated in the same way as the first.&nbsp; Another, and probably better possibility would be to let people handle the validation themselves.&nbsp; A regular expression validator could handle most things.&nbsp; The last thing I could think of would be to set the validator up in the control (maybe one for each type??), if that is even possible.&nbsp;\r\n",
    "PostedDate": "2008-08-23T21:16:21.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113398",
    "ThreadId": "33330",
    "Html": "Good points blovett. I guess we could quickly include the metadata attribute and then you can at least use a custom validator with the RTE.<br>\r\n",
    "PostedDate": "2008-08-25T05:23:41.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]